In [1]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (0.3.9)
Requirement already satisfied: ipython>=1.0 in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from ipython-sql) (7.16.1)
Requirement already satisfied: sqlparse in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from ipython-sql) (0.4.1)
Requirement already satisfied: prettytable in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from ipython-sql) (2.0.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from ipython-sql) (1.3.20)
Requirement already satisfied: six in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from ipython-sql) (1.15.0)
Requirement already satisfied: decorator in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from ipython>=1.0->ipython-sql) (4.4.2)
Requirement already satisfied: backcall in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from ipython>=1.0->ipython-sql) (3.0.8)
Requirement already satisfied: pexpect; sys_platform != "win32" in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from ipython>=1.0->ipython-sql) (4.8.0)
Requirement already satisfied: pygments in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from ipython>=1.0->ipython-sql) (2.7.3)
Requirement already satisfied: traitlets>=4.2 in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from ipython>=1.0->ipython-sql) (4.3.3)
Requirement already satisfied: jedi>=0.10 in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from ipython>=1.0->ipython-sql) (0.17.2)
Requirement already satisfied: pickleshare in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: setuptools>=18.5 in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from ipython>=1.0->ipython-sql) (49.6.0.post20201009)
Requirement already satisfied: wcwidth in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from prettytable->ipython-sql) (0.2.5)
Requirement already satisfied: ptyprocess>=0.5 in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from pexpect; sys_platform != "win32"->ipython>=1.0->ipython-sql) (0.6.0)
Requirement already satisfied: parso<0.8.0,>=0.7.0 in /home/jupyterlab/conda/envs/python/lib/python3.6/site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.7.1)

In [2]:
%reload_ext sql

%sql sqlite://

'Connected: @None'

In [3]:
%%sql

CREATE TABLE athletes (
   id INTEGER, 
   name TEXT, 
   age INTEGER,
   rating INTEGER
);

 * sqlite://
Done.

[]

In [5]:
%%sql


INSERT INTO athletes (id, name, age, rating) 
VALUES (1, 'Nicol David', 36, 85.59);

INSERT INTO athletes (id, name, age, rating) 
VALUES (2, 'Syazlin Zulkifli', 38, 88.76); 

INSERT INTO athletes (id, name, age, rating) 
VALUES (3, 'Lee Chong Wei', 36, 92.24); 

INSERT INTO athletes (id, name, age, rating) 
VALUES (4, 'Dollah Salleh', 46, 86.22);

INSERT INTO athletes (id, name, age, rating) 
VALUES (5, 'Wong Choong Hann', 47, 85.59);

INSERT INTO athletes (id, name, age, rating) 
VALUES (6, 'Azizulhasni Awang', 36, 85.59);

INSERT INTO athletes (id, name, age, rating) 
VALUES (7, 'Mirnawan Nawawi', 46, 86.22);

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [6]:
%%sql

select * from athletes;

 * sqlite://
Done.

[(1, 'Nicol David', 36, 85.59),
 (2, 'Syazlin Zulkifli', 38, 88.76),
 (3, 'Lee Chong Wei', 36, 92.24),
 (4, 'Dollah Salleh', 46, 86.22),
 (5, 'Wong Choong Hann', 47, 85.59),
 (6, 'Azizulhasni Awang', 36, 85.59),
 (7, 'Mirnawan Nawawi', 46, 86.22)]

In [7]:
# Adding a new column

%%sql

ALTER TABLE athletes 
ADD COLUMN sport TEXT; 
 
SELECT * FROM athletes;

 * sqlite://
Done.
Done.

[(1, 'Nicol David', 36, 85.59, None),
 (2, 'Syazlin Zulkifli', 38, 88.76, None),
 (3, 'Lee Chong Wei', 36, 92.24, None),
 (4, 'Dollah Salleh', 46, 86.22, None),
 (5, 'Wong Choong Hann', 47, 85.59, None),
 (6, 'Azizulhasni Awang', 36, 85.59, None),
 (7, 'Mirnawan Nawawi', 46, 86.22, None)]

In [8]:
# inserting values into the new column

%%sql

UPDATE athletes 
SET sport = 'squash' 
WHERE id = 1;

UPDATE athletes 
SET sport = 'bowling' 
WHERE id = 2;

UPDATE athletes 
SET sport = 'badminton' 
WHERE id = 3;

UPDATE athletes 
SET sport = 'badminton' 
WHERE id = 5;

UPDATE athletes 
SET sport = 'cycling' 
WHERE id = 6;

UPDATE athletes 
SET sport = 'hockey' 
WHERE id = 7;



SELECT * FROM athletes;

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(1, 'Nicol David', 36, 85.59, 'squash'),
 (2, 'Syazlin Zulkifli', 38, 88.76, 'bowling'),
 (3, 'Lee Chong Wei', 36, 92.24, 'badminton'),
 (4, 'Dollah Salleh', 46, 86.22, None),
 (5, 'Wong Choong Hann', 47, 85.59, 'badminton'),
 (6, 'Azizulhasni Awang', 36, 85.59, 'cycling'),
 (7, 'Mirnawan Nawawi', 46, 86.22, 'hockey')]

In [9]:
# Selecting rows with no missing values for the sport column


%%sql

SELECT *
FROM athletes 
WHERE sport IS NOT NULL;

 * sqlite://
Done.

[(1, 'Nicol David', 36, 85.59, 'squash'),
 (2, 'Syazlin Zulkifli', 38, 88.76, 'bowling'),
 (3, 'Lee Chong Wei', 36, 92.24, 'badminton'),
 (5, 'Wong Choong Hann', 47, 85.59, 'badminton'),
 (6, 'Azizulhasni Awang', 36, 85.59, 'cycling'),
 (7, 'Mirnawan Nawawi', 46, 86.22, 'hockey')]

In [10]:
# Deleting rows with missing values on the sport column

%%sql

DELETE FROM athletes 
WHERE sport IS NULL;

 * sqlite://
1 rows affected.

[]

In [11]:
# Row 4 is deleted

%%sql

select * from athletes;

 * sqlite://
Done.

[(1, 'Nicol David', 36, 85.59, 'squash'),
 (2, 'Syazlin Zulkifli', 38, 88.76, 'bowling'),
 (3, 'Lee Chong Wei', 36, 92.24, 'badminton'),
 (5, 'Wong Choong Hann', 47, 85.59, 'badminton'),
 (6, 'Azizulhasni Awang', 36, 85.59, 'cycling'),
 (7, 'Mirnawan Nawawi', 46, 86.22, 'hockey')]

In [12]:
# Changing the name of id column, and the result is limited to 3 rows.

%%sql

SELECT id AS 'id_no' FROM athletes
Limit 3;

 * sqlite://
Done.

[(1,), (2,), (3,)]

In [13]:
# Select all distinctive values of age column, having no duplicates

%%sql

SELECT DISTINCT age FROM athletes;

 * sqlite://
Done.

[(36,), (38,), (47,), (46,)]

In [14]:
# Selecting rows which their name values containing the letters 'awan'.

%%sql

SELECT * 
FROM athletes
WHERE name LIKE '%awan%';

 * sqlite://
Done.

[(6, 'Azizulhasni Awang', 36, 85.59, 'cycling'),
 (7, 'Mirnawan Nawawi', 46, 86.22, 'hockey')]

In [15]:
# Selects an athlete who's still in the 30's and plays squash

%%sql

SELECT *
FROM athletes
WHERE age BETWEEN 30 AND 39
AND sport = 'squash';

 * sqlite://
Done.

[(1, 'Nicol David', 36, 85.59, 'squash')]

In [16]:
# Selecting an athlete aged less than 40 and having the result ordered alphabetically 

%%sql

SELECT *
FROM athletes
WHERE age < 40
ORDER BY name ASC;

 * sqlite://
Done.

[(6, 'Azizulhasni Awang', 36, 85.59, 'cycling'),
 (3, 'Lee Chong Wei', 36, 92.24, 'badminton'),
 (1, 'Nicol David', 36, 85.59, 'squash'),
 (2, 'Syazlin Zulkifli', 38, 88.76, 'bowling')]

In [17]:
# Creating a new output based on the current dataset

%%sql

select *,
  case
  when age > 46 then 'Retired'
  when age < 40 then 'Active'
  else 'Semi-Retired'
  end as 'status'
from athletes;

 * sqlite://
Done.

[(1, 'Nicol David', 36, 85.59, 'squash', 'Active'),
 (2, 'Syazlin Zulkifli', 38, 88.76, 'bowling', 'Active'),
 (3, 'Lee Chong Wei', 36, 92.24, 'badminton', 'Active'),
 (5, 'Wong Choong Hann', 47, 85.59, 'badminton', 'Retired'),
 (6, 'Azizulhasni Awang', 36, 85.59, 'cycling', 'Active'),
 (7, 'Mirnawan Nawawi', 46, 86.22, 'hockey', 'Semi-Retired')]

In [18]:
# Counting the number of badminton values in the sport column

%%sql

SELECT count(*) FROM athletes
WHERE sport = 'badminton';

 * sqlite://
Done.

[(2,)]

In [19]:
# Finding the average age of all the athletes

%%sql

SELECT AVG(age) FROM athletes;

 * sqlite://
Done.

[(39.833333333333336,)]

In [20]:
# Selecting the oldest age among the athletes

%%sql

SELECT max(age) FROM athletes;

 * sqlite://
Done.

[(47,)]

In [21]:
# Having the average age value obtained, rounded to a desired value

%%sql

SELECT ROUND(AVG(age), 2)
FROM athletes;

 * sqlite://
Done.

[(39.83,)]

In [22]:
# Counting all rating values and group them by each rating 

%%sql

SELECT rating, COUNT(*)
FROM athletes
GROUP BY 1;

 * sqlite://
Done.

[(85.59, 3), (86.22, 1), (88.76, 1), (92.24, 1)]